import { NextRequest, NextResponse } from "next/server";
import { analyzeText } from "@/lib/openai/utils";

const text = `  
საქართველოს კანონი   

ამნისტიის შესახებ 
საქართველოს სახელმწიფო, ჰუმანიზმის პრინციპიდან გამომდინარე, ერთჯერადი, დროებითი და განსაკუთრებული ღონისძიების სახით, საზოგადოებრივი საშიშროების ხარისხის გათვალისწინებით, ამ კანონის საფუძველზე, სისხლისსამართლებრივი პასუხისმგებლობისა და სასჯელისგან ათავისუფლებს საქართველოს სისხლის სამართლის კოდექსით (საქართველოს საკანონმდებლო მაცნე, №41(48), 1999 წელი, მუხ. 209) გათვალისწინებული დანაშაულის ჩადენისთვის ბრალდებულ და მსჯავრდებულ პირებს. 
მუხლი 1. 
1. გათავისუფლდეს სისხლისსამართლებრივი პასუხისმგებლობისა და სასჯელისგან პირი, რომელმაც 2020 წლის 18 აგვისტომდე ჩაიდინა საქართველოს სისხლის სამართლის კოდექსის 303-ე მუხლის პირველი ნაწილით გათვალისწინებული დანაშაული (გარდა საქართველოს ადმინისტრაციულ სამართალდარღვევათა კოდექსის 641 მუხლის პირველი ნაწილით, 66-ე მუხლის მე-2 ნაწილით, 151-ე მუხლის მე-2 ნაწილით ან 1511 მუხლის მე-2 ნაწილით გათვალისწინებული ადმინისტრაციული სამართალდარღვევის ჩადენისთვის ადმინისტრაციულსახდელდადებული პირის მიერ ხე-ბუჩქნარის უკანონოდ გაჩეხვისა). 
2. ამ მუხლით გათვალისწინებული ამნისტია ამავე მუხლის პირველი პუნქტით განსაზღვრულ პირზე ვრცელდება მხოლოდ იმ შემთხვევაში, თუ მან იმავე პუნქტით გათვალისწინებული დანაშაული იმ მიწის ნაკვეთზე ან განაშენიანების რეგულირების გეგმის/განაშენიანების დეტალური გეგმის იმ არეალში ჩაიდინა, სადაც საქართველოს სივრცის დაგეგმარების, არქიტექტურული და სამშენებლო საქმიანობის კოდექსის 1413 მუხლის ან პროდუქტის უსაფრთხოებისა და თავისუფალი მიმოქცევის კოდექსის 1033 მუხლის შესაბამისად ექსპლუატაციაში მიღებული ობიექტია განთავსებული. 
3. ამ მუხლით გათვალისწინებული ამნისტია ვრცელდება იმ პირზედაც, რომელმაც ჩაიდინა ამ მუხლით გათვალისწინებული დანაშაულის მომზადება ან მცდელობა. 
4. ამ მუხლით გათვალისწინებული ამნისტია ვრცელდება აგრეთვე პირობით მსჯავრსა და აღუსრულებელ ჯარიმაზე. 
5. პირზე ამ მუხლით გათვალისწინებული ამნისტიის გავრცელების შემთხვევაში ეს პირი ნასამართლობის არმქონედ ითვლება. 
მუხლი 2 
პირის მიერ ამ კანონის პირველი მუხლით გათვალისწინებული დანაშაულის ჩადენის შემთხვევაში მის მიმართ საქართველოს სისხლის სამართლის საპროცესო კოდექსით განსაზღვრული ღონისძიებები არ უნდა დაიწყოს, ხოლო დაწყებული ღონისძიებები უნდა შეჩერდეს ამ კანონის პირველი მუხლის მე-2 პუნქტით გათვალისწინებული ობიექტის ექსპლუატაციაში მიღებამდე. ამ პერიოდში საქართველოს სისხლის სამართლის კოდექსის 71-ე მუხლით განსაზღვრული ვადა ჩერდება. 
მუხლი 3 
1. პირის მიერ ამ კანონის პირველი მუხლით განსაზღვრული პირობების დაკმაყოფილებისთანავე მასზე იმავე მუხლით გათვალისწინებული ამნისტიის გავრცელების მიზნით: 
ა) გამოძიება არ იწყება; 
ბ) გამოძიების ეტაპზე ბრალდებულის, მათ შორის, ძებნილი ბრალდებულის, მიმართ.
სისხლისსამართლებრივი დევნის შეწყვეტის შესახებ გადაწყვეტილებას იღებს შესაბამისი პროკურორი; 
გ) სისხლის სამართლის საქმის სასამართლო განხილვის ეტაპზე ბრალდებულის, მათ შორის, ძებნილი ბრალდებულის, მიმართ სისხლისსამართლებრივი დევნის შეწყვეტის შესახებ/მსჯავრდებულის სასჯელისგან გათავისუფლების თაობაზე გადაწყვეტილებას ზეპირი მოსმენით ან მის გარეშე იღებს შესაბამისი სასამართლო; 
დ) სისხლის სამართლის საქმეზე სამართალწარმოების დასრულების შემთხვევაში მსჯავრდებულის სასჯელისგან გათავისუფლების თაობაზე გადაწყვეტილებას ზეპირი მოსმენით ან მის გარეშე იღებს მის მიმართ თავდაპირველი განაჩენის გამომტანი რაიონული (საქალაქო) სასამართლო; 
ე) ძებნილი მსჯავრდებულის სასჯელისგან გათავისუფლების თაობაზე გადაწყვეტილებას ზეპირი მოსმენით ან მის გარეშე იღებს: 
ე.ა) სააპელაციო სასამართლო, თუ ძებნილმა მსჯავრდებულმა მის მიმართ გამოტანილი განაჩენი საქართველოს სისხლის სამართლის საპროცესო კოდექსის 292-ე მუხლის მე-3 ნაწილით დადგენილი წესით გაასაჩივრა; 
ე.ბ) საქართველოს უზენაესი სასამართლო, თუ ძებნილი მსჯავრდებულის მიმართ გამოტანილი განაჩენი საქართველოს სისხლის სამართლის საპროცესო კოდექსის მე-300 მუხლის მე-3 ნაწილით დადგენილი წესით არის გასაჩივრებული; 
ე.გ) ძებნილი მსჯავრდებულის მიმართ თავდაპირველი განაჩენის გამომტანი რაიონული (საქალაქო) სასამართლო, თუ ძებნილ მსჯავრდებულს ეს განაჩენი საქართველოს სისხლის სამართლის საპროცესო კოდექსის 292-ე მუხლის მე-3 ნაწილით ან მე-300 მუხლის მე-3 ნაწილით დადგენილი წესით არ გაუსაჩივრებია. 
2. ამ მუხლის პირველი პუნქტის „დ“ ქვეპუნქტით გათვალისწინებულ შემთხვევაში მსჯავრდებულის მიმართ თავდაპირველი განაჩენის გამომტან რაიონულ (საქალაქო) სასამართლოს: 
ა) მსჯავრდებულის პირად საქმეს და ჯარიმის აღსრულების თაობაზე ინფორმაციას მსჯავრდებულის წერილობითი მიმართვის საფუძველზე უგზავნის შესაბამისი პენიტენციური დაწესებულება, თუ მსჯავრდებული სასჯელს პენიტენციურ დაწესებულებაში იხდის; 
ბ) მსჯავრდებულის პირად საქმეს და ჯარიმის აღსრულების თაობაზე ინფორმაციას მსჯავრდებულის წერილობითი მიმართვის საფუძველზე უგზავნის საჯარო სამართლის იურიდიული პირის − დანაშაულის პრევენციის, არასაპატიმრო სასჯელთა აღსრულებისა და პრობაციის ეროვნული სააგენტოს შესაბამისი ტერიტორიული ორგანო − დანაშაულის პრევენციის, არასაპატიმრო სასჯელთა აღსრულებისა და პრობაციის ბიურო, თუ მსჯავრდებულს არასაპატიმრო სასჯელი აქვს შეფარდებული ან იგი პრობაციის რეჟიმში იმყოფება; 
გ) სააღსრულებო საქმის მასალებს მსჯავრდებულის წერილობითი მიმართვის საფუძველზე უგზავნის საქართველოს იუსტიციის სამინისტროს მმართველობის სფეროში მოქმედი საჯარო სამართლის იურიდიული პირი − აღსრულების ეროვნული ბიურო, თუ მსჯავრდებულს სასჯელის სახით შეფარდებული აქვს მხოლოდ ჯარიმა და ის არ აღსრულებულა. 
3. ამ მუხლის პირველი პუნქტის „ე.გ“ ქვეპუნქტით გათვალისწინებულ შემთხვევაში ძებნილი მსჯავრდებულის მიმართ თავდაპირველი განაჩენის გამომტან რაიონულ (საქალაქო) სასამართლოს წერილობით მიმართავს ძებნილი მსჯავრდებული ან მისი ადვოკატი ან ოჯახის სრულწლოვანი წევრი. 
მუხლი 4 
პირს, რომელზედაც ვრცელდება ამ კანონით გათვალისწინებული ამნისტია, უფლება აქვს, ისარგებლოს მისი სისხლის სამართლის საქმის სამართლიანი სასამართლოს მიერ განხილვის უფლებით. 
მუხლი 5 
ბრალდებულს/მსჯავრდებულს უფლება აქვს, მასზე ამ კანონით გათვალისწინებული ამნისტიის გაუვრცელებლობის თაობაზე გადაწყვეტილება ერთჯერადად გაასაჩივროს მისთვის აღნიშნული გადაწყვეტილების ჩაბარებიდან 2 კვირის ვადაში, საქართველოს უზენაესი სასამართლოს სისხლის სამართლის საქმეთა პალატაში. საქართველოს უზენაესი სასამართლო ამ საჩივარს განიხილავს მისი დასაშვებობის საკითხის გადაწყვეტის გარეშე, საჩივრის მისთვის წარდგენიდან 10 დღის ვადაში, ზეპირი მოსმენით ან მის გარეშე. 
მუხლი 6 
ეს კანონი ამოქმედდეს გამოქვეყნებიდან მე-15 დღეს. 
საქართველოს პრეზიდენტი სალომე ზურაბიშვილი   
 თბილისი, 
12 ივლისი 2021 წ. 
`;

export async function POST(request: NextRequest) {
  try {
    const { question } = await request.json();

    const answer = await analyzeText(text, question);

    return NextResponse.json({
      success: true,
      answer,
    });
  } catch (error) {
    console.error("error in test openai route", error);
    return NextResponse.json(
      {
        success: false,
        message: "Error in test openai route",
      },
      { status: 500 }
    );
  }
}
